model
Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 48000, 1)]        0         
_________________________________________________________________
conv1d (Conv1D)              (None, 24000, 32)         128       
_________________________________________________________________
dropout (Dropout)            (None, 24000, 32)         0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 12000, 32)         3104      
_________________________________________________________________
dropout_1 (Dropout)          (None, 12000, 32)         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 6000, 32)          3104      
_________________________________________________________________
dropout_2 (Dropout)          (None, 6000, 32)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 3000, 32)          3104      
_________________________________________________________________
dropout_3 (Dropout)          (None, 3000, 32)          0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 1500, 64)          6208      
_________________________________________________________________
dropout_4 (Dropout)          (None, 1500, 64)          0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 750, 64)           12352     
_________________________________________________________________
dropout_5 (Dropout)          (None, 750, 64)           0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 375, 64)           12352     
_________________________________________________________________
dropout_6 (Dropout)          (None, 375, 64)           0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 188, 64)           12352     
_________________________________________________________________
dropout_7 (Dropout)          (None, 188, 64)           0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 94, 128)           24704     
_________________________________________________________________
dropout_8 (Dropout)          (None, 94, 128)           0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 47, 128)           49280     
_________________________________________________________________
dropout_9 (Dropout)          (None, 47, 128)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 24, 128)           49280     
_________________________________________________________________
dropout_10 (Dropout)         (None, 24, 128)           0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 12, 128)           49280     
_________________________________________________________________
dropout_11 (Dropout)         (None, 12, 128)           0         
_________________________________________________________________
flatten (Flatten)            (None, 1536)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               196736    
_________________________________________________________________
lambda (Lambda)              (None, 128)               0         
=================================================================
Total params: 421,984
Trainable params: 421,984
Non-trainable params: 0
_________________________________________________________________

